---
kind: other
id: Properties.T:Autodesk.Revit.DB.ElementIntersectsElementFilter
source: html/0c8acfed-697d-9ea9-ddc7-446bde8249e6.htm
---
# ElementIntersectsElementFilter Properties

True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected,
 and elements that would normally be rejected will be accepted.